Autodesk.Revit.DB.DatumPlane.SetDatumExtentType(Autodesk.Revit.DB.DatumEnds,Autodesk.Revit.DB.View,Autodesk.Revit.DB.DatumExtentType)
Sets whether or not the end of the datum plane is aligned with 3D extents or is set to vary specifically in the indicated view.
datumEnd:
Specifies one end of the datum plane in the view.
view:
The view in which to evaluate the datum extent settings.
extentMode:
The DatumExtentType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The datum plane cannot be visible in the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.DatumPlane.Maximize3DExtents
Maximizes the 3d extents of the datum plane in all possible views.
Since:
2016

Autodesk.Revit.DB.DatumPlane.GetDatumExtentTypeInView(Autodesk.Revit.DB.DatumEnds,Autodesk.Revit.DB.View)
Identifies if the end of the datum plane is aligned with 3D extents or is set to vary specifically in the indicated view.
datumEnd:
The end of the datum plane.
view:
The view in which to evaluate the datum extent settings.
Returns:
The extent type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The datum plane cannot be visible in the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.DatumPlane
A base class representing a datum surface (level, grid or reference plane) in Autodesk Revit.
Since:
2016